app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def index
    @user = User.find(session[:user_id])

SELECT `users`.* FROM `users` WHERE `users`.`login` = 'login' LIMIT 1
---
  def process_login
    login = User.find_by_login(params[:login])

INSERT INTO `users` (`created_at`, `email`, `first_name`, `last_name`, `login`, `password_digest`, `updated_at`) VALUES ('2015-09-30 21:58:04', 'kyle@gmail.com', 'kyle', 'hughes', 'hughes', '$2a$10$WlT/r7HVWunyKAPTYmVttOfIXsKB/40QhMEY51P5tsMdv3J848rPG', '2015-09-30 21:58:04')
---
  def create
    @user= User.new(params[:user])
      if @user.save